#include <iostream>
#include <vector>
#include <string>
using namespace std;

//Boo子有親(부자유친)! 부스트를 늘 여러분 가까이에

namespace Item55 {
	/*
		책에서 말하길, 현장에 당장 투입할 수 있을 정도로 품질이 우수하고, 실탄 부담도 적은 동시에 속알맹이도 들여다볼 수 있게 오픈 소스이고, 
		어지간한 플랫폼과 컴파일러에서 모두 돌아가는 C++ 라이브러리가 부스트라고 한다.

		다음은 부스트의 라이브러리 군단

		- 문자열 및 텍스트 처리
		- 컨테이너 : stl 양식의 인터페이스를 제공하는 고정 크기 배열, 가변 크기 비트세트, 다차원 배열 등이 포함되었다.
		- 함수 객체 및 고차(higher-order) 프로그래밍 : tr1의 기능을 구현하는 데 사용된 몇 개의 기반 라이브러리가 여기에 해당된다. 이중 한 가지가 람다(lambda)
		- 일반화 프로그래밍
		- 템플릿 메타 프로그래밍 : 대표적으로 타입을 담아 관리하는 타입리스트(typelist) 컨테이너가 있다.
		- 수학 및 수치 조작 : 유리수, 사원수(quaternion) 및 8 원수(octonion) 등
		- 정확성 유지 및 테스트 : 암시적 템플릿 인터페이스를 형식화해 주는 라이브러리와 테스트 우선 프로그래밍을 가능하게 해 주는 라이브러리 포함
		- 자료구조 : 타입 안전성(크기와 쓰임이 가지가지인 "어떤" 타입도 담을 수 있는 자료구조)을 갖춘 공용체, 그리고 tr1 에서 지원하는 투플 라이브러리 등
		- 타 언어와의 연동 지원 : 파이썬 등
		- 메모리 : 고성능의 고정 크기 할당자를 지원하는 풀(pool) 라이브러리 및 스마트 포인터 등
	*/
}